lukasnee/m8ec/platform/STM32H750/USB_HOST/Target/usbh_conf.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : Target/usbh_conf.h
  * @version        : v1.0_Cube
  * @brief          : Header for usbh_conf.c file.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __USBH_CONF__H__
#define __USBH_CONF__H__
#ifdef __cplusplus
 extern "C" {
#endif
/* Includes ------------------------------------------------------------------*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "main.h"

#include "stm32h7xx.h"
#include "stm32h7xx_hal.h"

/* USER CODE BEGIN INCLUDE */
#include "fonas/fonas.h"
/* USER CODE END INCLUDE */

/** @addtogroup STM32_USB_HOST_LIBRARY
  * @{
  */

/** @defgroup USBH_CONF
  * @brief usb host low level driver configuration file
  * @{
  */

/** @defgroup USBH_CONF_Exported_Variables USBH_CONF_Exported_Variables
  * @brief Public variables.
  * @{
  */

/**
  * @}
  */

/** @defgroup USBH_CONF_Exported_Defines USBH_CONF_Exported_Defines
  * @brief Defines for configuration of the Usb host.
  * @{
  */

/*----------   -----------*/
#define USBH_MAX_NUM_ENDPOINTS      5U

/*----------   -----------*/
#define USBH_MAX_NUM_INTERFACES      10U

/*----------   -----------*/
#define USBH_MAX_NUM_CONFIGURATION      1U

/*----------   -----------*/
#define USBH_KEEP_CFG_DESCRIPTOR      1U

/*----------   -----------*/
#define USBH_MAX_NUM_SUPPORTED_CLASS      5U

#define USBH_MAX_NUM_ACTIVE_CLASSES       8// TODO figure why fifth M8 Headless class breaks everything

/*----------   -----------*/
#define USBH_MAX_SIZE_CONFIGURATION      1024U

/*----------   -----------*/
#define USBH_MAX_DATA_BUFFER      1024U

/*----------   -----------*/
#define USBH_DEBUG_LEVEL      2U

/*----------   -----------*/
#define USBH_USE_OS      1U

#define USBH_IN_NAK_PROCESS                   0


/****************************************/
/* #define for FS and HS identification */
#define HOST_HS 		0
#define HOST_FS 		1

#if (USBH_USE_OS == 1)
  #include "cmsis_os.h"
  #define USBH_PROCESS_PRIO          1
  #define USBH_PROCESS_STACK_SIZE    ((uint16_t)4 * 1024)
#endif /* (USBH_USE_OS == 1) */

/**
  * @}
  */

/** @defgroup USBH_CONF_Exported_Macros USBH_CONF_Exported_Macros
  * @brief Aliases.
  * @{
  */

/* Memory management macros */

/** Alias for memory allocation. */
#define USBH_malloc         pvPortMalloc

/** Alias for memory release. */
#define USBH_free           vPortFree

/** Alias for memory set. */
#define USBH_memset         memset

/** Alias for memory copy. */
#define USBH_memcpy         memcpy

/* DEBUG macros */

#include "fonas/logger/logger.h"

extern LoggerModule logmod_usbh;

#if (USBH_DEBUG_LEVEL > 0U)
#define USBH_ErrLog(...)                                                                                                       \
  do {                                                                                                                         \
    fonas_logger_log(&logmod_usbh, LOGGER_LEVEL_ERROR, __VA_ARGS__);                                                                 \
  } while (0)
#else
#define USBH_ErrLog(...)
#endif

#if (USBH_DEBUG_LEVEL > 1U)
#define USBH_UsrLog(...)                                                                                                       \
  do {                                                                                                                         \
    fonas_logger_log(&logmod_usbh, LOGGER_LEVEL_INFO, __VA_ARGS__);                                                                  \
  } while (0)
#else
#define USBH_UsrLog(...)
#endif

#if (USBH_DEBUG_LEVEL > 2U)
#define USBH_DbgLog(...)                                                                                                       \
  do {                                                                                                                         \
    fonas_logger_log(&logmod_usbh, LOGGER_LEVEL_DEBUG, __VA_ARGS__);                                                                 \
  } while (0)
#else
#define USBH_DbgLog(...)
#endif

#if (USBH_DEBUG_LEVEL > 3U)
#define USBH_TrcLog(...)                                                                                                       \
  do {                                                                                                                         \
    fonas_logger_log(&logmod_usbh, LOGGER_LEVEL_DEBUG2, __VA_ARGS__);                                                                \
  } while (0)
#else
#define USBH_TrcLog(...)
#endif
/**
  * @}
  */

/** @defgroup USBH_CONF_Exported_Types USBH_CONF_Exported_Types
  * @brief Types.
  * @{
  */

/**
  * @}
  */

/** @defgroup USBH_CONF_Exported_FunctionsPrototype USBH_CONF_Exported_FunctionsPrototype
  * @brief Declaration of public functions for Usb host.
  * @{
  */

/* Exported functions -------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __USBH_CONF__H__ */

